# Total and Running Values

We have two tables. One table has all $ transactions from users during the month of March and one for the month of April.

Write a query that returns the total amount of money spent by each user. That is, the sum of the column transaction_amount for each user over both tables.

Write a query that returns day by day the cumulative sum of money spent by each user. That is, each day a user had a transcation, we should have how much money she has spent in total until that day. Obviously, the last day cumulative sum should match the numbers from the previous bullet point.

<img src="./example-data.png" width="100%">

In [1]:
import pandas as pd
txns_url = 'https://raw.githubusercontent.com/data-eng-10-21/interview-questions/main/ds-sql/3-total-and-running-values/query_five_transactions.csv'
users_url = 'https://raw.githubusercontent.com/data-eng-10-21/interview-questions/main/ds-sql/3-total-and-running-values/query_five_users.csv'
transactions_df = pd.read_csv(txns_url)
users_df = pd.read_csv(users_url)

In [11]:
import sqlite3
conn = sqlite3.connect('crm.db')

In [12]:
transactions_df.to_sql('transactions', conn)
users_df.to_sql('users', conn)

1982

In [13]:
pd.read_sql('select * from users', conn)[:3]

   index  user_id sign_up_date
0      0      121   2015-01-02
1      1      617   2015-01-02
2      2      619   2015-01-02

In [15]:
pd.read_sql('select * from transactions', conn)[:3]

   index  user_id     transaction_date  transaction_amount
0      0   856898  2015-08-02 03:56:08                  49
1      1   703491  2015-07-04 17:05:25                  72
2      2   444167  2015-02-10 03:26:03                  65